# Sorting data

In [1]:
import pandas as pd 
import numpy as np

In [2]:
#  dummy dictionary to convert it into dataframe

data = {
    'first_name': ['Alice', 'Bob', 'Charlie', 'David'],
    'last_name': ['Pretty', 'Chura', 'BC', 'BSDK'],
    'age': [25, 32, 18, 47],
    'city': ['New York', 'Paris', 'London', 'San Francisco'],
    'salary':[10000,120000,125000,105000]
}

In [3]:
data = pd.DataFrame(data)

In [4]:
df = pd.read_csv("CSVs\survey_results_public.csv")

In [6]:
# Sorting dataframe by "last_name"
data.sort_values(by="last_name")

  first_name last_name  age           city  salary
2    Charlie        BC   18         London  125000
3      David      BSDK   47  San Francisco  105000
1        Bob     Chura   32          Paris  120000
0      Alice    Pretty   25       New York   10000

In [9]:
# we can set the ascending argument to False to sort the values in descending order
# sort_values() also has inplace argument
data.sort_values(by="last_name", ascending=False)

  first_name last_name  age           city  salary
0      Alice    Pretty   25       New York   10000
1        Bob     Chura   32          Paris  120000
3      David      BSDK   47  San Francisco  105000
2    Charlie        BC   18         London  125000

## Sorting on multiple columns

In [11]:
data.sort_values(by=["last_name","first_name"], ascending=False)

# first pandas sort the inner level which is "first_name" and then sort the upper level which is "last_name"

  first_name last_name  age           city  salary
0      Alice    Pretty   25       New York   10000
1        Bob     Chura   32          Paris  120000
3      David      BSDK   47  San Francisco  105000
2    Charlie        BC   18         London  125000

In [12]:
# ascending and descending on multiple columns
data.sort_values(by=["last_name","first_name"], ascending=[False,True])

# first pandas do sorting with ascending True on inner level which is "first_name" and than upper level with ascending sorder

  first_name last_name  age           city  salary
0      Alice    Pretty   25       New York   10000
1        Bob     Chura   32          Paris  120000
3      David      BSDK   47  San Francisco  105000
2    Charlie        BC   18         London  125000